## Terraform Plan Results

| Step | Status |
|------|--------|
| 🖌️ Format | ✅ Success |
| ⚙️ Init | ✅ Success |
| ✅ Validate | ✅ Success |
| 📖 Plan | ✅ Success |

<details><summary>📋 Show Plan Output</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.scheduler.aws_iam_policy.scheduler will be created
  + resource "aws_iam_policy" "scheduler" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for EventBridge Scheduler to manage ECS and RDS"
      + id               = (known after apply)
      + name             = "keirekipro-scheduler-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecs:UpdateService"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:ap-northeast-1:498457470034:service/keirekipro-cluster/keirekipro-backend-service"
                      + Sid      = "ECSAccess"
                    },
                  + {
                      + Action   = [
                          + "rds:StartDBInstance",
                          + "rds:StopDBInstance",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:rds:ap-northeast-1:498457470034:db:keirekipro-db"
                      + Sid      = "RDSAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "keirekipro-scheduler-policy"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "keirekipro-scheduler-policy"
          + "Project"     = "keirekipro"
        }
    }

  # module.scheduler.aws_iam_role.scheduler will be created
  + resource "aws_iam_role" "scheduler" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "scheduler.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "keirekipro-scheduler-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "keirekipro-scheduler-role"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "keirekipro-scheduler-role"
          + "Project"     = "keirekipro"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.scheduler.aws_iam_role_policy_attachment.scheduler will be created
  + resource "aws_iam_role_policy_attachment" "scheduler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "keirekipro-scheduler-role"
    }

  # module.scheduler.aws_scheduler_schedule.ecs_start will be created
  + resource "aws_scheduler_schedule" "ecs_start" {
      + arn                          = (known after apply)
      + description                  = "Start ECS service on weekday mornings"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "keirekipro-ecs-start"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 23 ? * SUN-THU *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:ecs:updateService"
          + input    = jsonencode(
                {
                  + Cluster      = "keirekipro-cluster"
                  + DesiredCount = 1
                  + Service      = "keirekipro-backend-service"
                }
            )
          + role_arn = (known after apply)

          + retry_policy {
              + maximum_event_age_in_seconds = 86400
              + maximum_retry_attempts       = 2
            }
        }
    }

  # module.scheduler.aws_scheduler_schedule.ecs_stop will be created
  + resource "aws_scheduler_schedule" "ecs_stop" {
      + arn                          = (known after apply)
      + description                  = "Stop ECS service on weekday evenings"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "keirekipro-ecs-stop"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 11 ? * MON-FRI *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:ecs:updateService"
          + input    = jsonencode(
                {
                  + Cluster      = "keirekipro-cluster"
                  + DesiredCount = 0
                  + Service      = "keirekipro-backend-service"
                }
            )
          + role_arn = (known after apply)

          + retry_policy {
              + maximum_event_age_in_seconds = 86400
              + maximum_retry_attempts       = 2
            }
        }
    }

  # module.scheduler.aws_scheduler_schedule.rds_start will be created
  + resource "aws_scheduler_schedule" "rds_start" {
      + arn                          = (known after apply)
      + description                  = "Start RDS on weekday mornings"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "keirekipro-rds-start"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(50 22 ? * SUN-THU *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:rds:startDBInstance"
          + input    = jsonencode(
                {
                  + DbInstanceIdentifier = "keirekipro-db"
                }
            )
          + role_arn = (known after apply)

          + retry_policy {
              + maximum_event_age_in_seconds = 86400
              + maximum_retry_attempts       = 2
            }
        }
    }

  # module.scheduler.aws_scheduler_schedule.rds_stop will be created
  + resource "aws_scheduler_schedule" "rds_stop" {
      + arn                          = (known after apply)
      + description                  = "Stop RDS on weekday evenings"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "keirekipro-rds-stop"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(5 11 ? * MON-FRI *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:rds:stopDBInstance"
          + input    = jsonencode(
                {
                  + DbInstanceIdentifier = "keirekipro-db"
                }
            )
          + role_arn = (known after apply)

          + retry_policy {
              + maximum_event_age_in_seconds = 86400
              + maximum_retry_attempts       = 2
            }
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @DogisRiki, Action: `pull_request`*